# Weekly Challenge 04

*Original URL* https://community.alteryx.com/t5/Weekly-Challenge/Challenge-5-HR-Position-Finder-Application/td-p/36732 and [**My Alteryx Approach**](https://github.com/dsmdavid/Alteryx-Weekly-Challenge/tree/master/sub_Challenge%2304)

## Brief

An HR department has a defined hierarchy for job identification across the organization. Depending on the job, the position within the hierarchy can change.

 
The goal is to create an analytical application that allows a HR rep to enter a position # (in this example, 33333) and return all records where the position is found within the hierarchy system.

In [1]:
import pandas as pd

## Approach I want to follow:
1. Read the data.
1. Create a function to query the data and return matching elements.
1. Make it "interactive" by asking user to input values (any value) **OR** display a list of values and select from them.

In [2]:
#Read the dataframe
df = pd.read_csv("./05_files/input_positions.csv")#,dtype=int)

In [3]:
df.head()

   Level0    Level1   Level2   Level3
0  123456       NaN      NaN      NaN
1  123456  111111.0      NaN      NaN
2  123456  111111.0  22222.0      NaN
3  123456  111111.0  22222.0  33333.0
4  123456  111111.0  23333.0      NaN

In [4]:
def get_query(df, query):
    '''Takes a df with all columns the same type,
    and a query: a list of values to check'''
    return df[df.isin(query).any(axis =1)]

In [5]:
query=str(input('Enter the value to check, use multiple values separated by a comma: ')).split(',')
#Convert query to integers:
query = [int(x) for x in query]
print('This is your query :', query)

Enter the value to check, use multiple values separated by a comma: 111111
This is your query : [111111]

In [6]:
get_query(df, query)

   Level0    Level1   Level2   Level3
1  123456  111111.0      NaN      NaN
2  123456  111111.0  22222.0      NaN
3  123456  111111.0  22222.0  33333.0
4  123456  111111.0  23333.0      NaN
5  123456  111111.0  23333.0  34444.0
6  123456  111111.0  23333.0  35555.0

## Alternatively...
building an app that lists all potential values and selecting from it: -- TEXT MODE --

In [7]:
query = []
dict_keys = {}
for k, v in enumerate(sorted(df.melt()['value'].unique(), reverse=True)):
    dict_keys[k]=v
print(dict_keys)
print('\n'*3)
while len(query) == 0:
    query=str(input('Enter the key of the values to retrieve; use multiple values separated by a comma: ')).split(',')
#Convert query to integers:
    query = [dict_keys.get(int(x)) for x in query if dict_keys.get(int(x)) is not None ]
    if len(query) == 0:
        print('Input is not valid, please use any of the integers from 0 to ',len(dict_keys))
    else:
        print('This is your query :', query)

{0: nan, 1: 3998877.0, 2: 399999.0, 3: 399888.0, 4: 388888.0, 5: 366666.0, 6: 235555.0, 7: 234444.0, 8: 123456.0, 9: 111111.0, 10: 37777.0, 11: 36677.0, 12: 35555.0, 13: 34444.0, 14: 33333.0, 15: 23333.0, 16: 22222.0, 17: 12222.0}




Enter the key of the values to retrieve; use multiple values separated by a comma: 1,3
This is your query : [3998877.0, 399888.0]

In [8]:
get_query(df, query)

    Level0   Level1    Level2     Level3
16  123456  12222.0  235555.0   399888.0
17  123456  12222.0  235555.0  3998877.0